3:I[4707,[],""]
6:I[6423,[],""]
4:["lang","zh","d"]
5:["mdxPath","reference/cpp_api/connection","oc"]
0:["je8eC_JZK93-MBmaHMjJL",[[["",{"children":[["lang","zh","d"],{"children":[["mdxPath","reference/cpp_api/connection","oc"],{"children":["__PAGE__?{\"lang\":\"zh\",\"mdxPath\":[\"reference\",\"cpp_api\",\"connection\"]}",{}]}]}]},"$undefined","$undefined",true],["",{"children":[["lang","zh","d"],{"children":[["mdxPath","reference/cpp_api/connection","oc"],{"children":["__PAGE__",{},[["$L1","$L2",null],null],null]},[null,["$","$L3",null,{"parallelRouterKey":"children","segmentPath":["children","$4","children","$5","children"],"error":"$undefined","errorStyles":"$undefined","errorScripts":"$undefined","template":["$","$L6",null,{}],"templateStyles":"$undefined","templateScripts":"$undefined","notFound":"$undefined","notFoundStyles":"$undefined"}]],null]},[[[["$","link","0",{"rel":"stylesheet","href":"/neug/_next/static/css/bdee4e52601962cd.css","precedence":"next","crossOrigin":"$undefined"}]],"$L7"],null],null]},[[[["$","link","0",{"rel":"stylesheet","href":"/neug/_next/static/css/16fb04f3f0386afc.css","precedence":"next","crossOrigin":"$undefined"}]],["$","html",null,{"suppressHydrationWarning":true,"children":[["$","head",null,{"children":["$undefined",["$","style",null,{"children":":root {\n  --nextra-primary-hue: 215deg;\n  --nextra-primary-saturation: 95%;\n  --nextra-primary-lightness: 45%;\n  --nextra-bg: 250,250,250;\n  --nextra-content-width: 90rem;\n}\n.dark {\n  --nextra-primary-hue: 215deg;\n  --nextra-primary-saturation: 95%;\n  --nextra-primary-lightness: 55%;\n  --nextra-bg: 17,17,17;\n}\n::selection {\n  background: hsla(var(--nextra-primary-hue),var(--nextra-primary-saturation),var(--nextra-primary-lightness),.3);\n}\nhtml {\n  background: rgb(var(--nextra-bg));\n}"}],["$","meta",null,{"name":"theme-color","media":"(prefers-color-scheme: light)","content":"rgb(250,250,250)"}],["$","meta",null,{"name":"theme-color","media":"(prefers-color-scheme: dark)","content":"rgb(17,17,17)"}],"$undefined"]}],["$","body",null,{"children":["$","$L3",null,{"parallelRouterKey":"children","segmentPath":["children"],"error":"$undefined","errorStyles":"$undefined","errorScripts":"$undefined","template":["$","$L6",null,{}],"templateStyles":"$undefined","templateScripts":"$undefined","notFound":[["$","title",null,{"children":"404: This page could not be found."}],["$","div",null,{"style":{"fontFamily":"system-ui,\"Segoe UI\",Roboto,Helvetica,Arial,sans-serif,\"Apple Color Emoji\",\"Segoe UI Emoji\"","height":"100vh","textAlign":"center","display":"flex","flexDirection":"column","alignItems":"center","justifyContent":"center"},"children":["$","div",null,{"children":[["$","style",null,{"dangerouslySetInnerHTML":{"__html":"body{color:#000;background:#fff;margin:0}.next-error-h1{border-right:1px solid rgba(0,0,0,.3)}@media (prefers-color-scheme:dark){body{color:#fff;background:#000}.next-error-h1{border-right:1px solid rgba(255,255,255,.3)}}"}}],["$","h1",null,{"className":"next-error-h1","style":{"display":"inline-block","margin":"0 20px 0 0","padding":"0 23px 0 0","fontSize":24,"fontWeight":500,"verticalAlign":"top","lineHeight":"49px"},"children":"404"}],["$","div",null,{"style":{"display":"inline-block"},"children":["$","h2",null,{"style":{"fontSize":14,"fontWeight":400,"lineHeight":"49px","margin":0},"children":"This page could not be found."}]}]]}]}]],"notFoundStyles":[]}]}]]}]],null],null],["$L8",null]]]]
9:I[4108,["501","static/chunks/c16f53c3-e0b1a3ec107d8984.js","549","static/chunks/549-7b41f257a2531a09.js","787","static/chunks/787-1c7ffb69c49bbba0.js","141","static/chunks/141-4801f5a1522ecf9a.js","218","static/chunks/218-ede9cc2c1bd98df6.js","84","static/chunks/app/%5Blang%5D/layout-7b74e2c6b4205188.js"],"ThemeConfigProvider"]
a:I[6016,["501","static/chunks/c16f53c3-e0b1a3ec107d8984.js","549","static/chunks/549-7b41f257a2531a09.js","787","static/chunks/787-1c7ffb69c49bbba0.js","141","static/chunks/141-4801f5a1522ecf9a.js","218","static/chunks/218-ede9cc2c1bd98df6.js","84","static/chunks/app/%5Blang%5D/layout-7b74e2c6b4205188.js"],"LastUpdated"]
b:I[763,["501","static/chunks/c16f53c3-e0b1a3ec107d8984.js","549","static/chunks/549-7b41f257a2531a09.js","787","static/chunks/787-1c7ffb69c49bbba0.js","141","static/chunks/141-4801f5a1522ecf9a.js","218","static/chunks/218-ede9cc2c1bd98df6.js","84","static/chunks/app/%5Blang%5D/layout-7b74e2c6b4205188.js"],"Search"]
c:I[5922,["501","static/chunks/c16f53c3-e0b1a3ec107d8984.js","549","static/chunks/549-7b41f257a2531a09.js","787","static/chunks/787-1c7ffb69c49bbba0.js","141","static/chunks/141-4801f5a1522ecf9a.js","218","static/chunks/218-ede9cc2c1bd98df6.js","84","static/chunks/app/%5Blang%5D/layout-7b74e2c6b4205188.js"],"ThemeProvider"]
d:I[4328,["501","static/chunks/c16f53c3-e0b1a3ec107d8984.js","549","static/chunks/549-7b41f257a2531a09.js","787","static/chunks/787-1c7ffb69c49bbba0.js","141","static/chunks/141-4801f5a1522ecf9a.js","218","static/chunks/218-ede9cc2c1bd98df6.js","84","static/chunks/app/%5Blang%5D/layout-7b74e2c6b4205188.js"],"SkipNavLink"]
e:I[7691,["501","static/chunks/c16f53c3-e0b1a3ec107d8984.js","549","static/chunks/549-7b41f257a2531a09.js","787","static/chunks/787-1c7ffb69c49bbba0.js","141","static/chunks/141-4801f5a1522ecf9a.js","218","static/chunks/218-ede9cc2c1bd98df6.js","84","static/chunks/app/%5Blang%5D/layout-7b74e2c6b4205188.js"],"ConfigProvider"]
f:I[2972,["501","static/chunks/c16f53c3-e0b1a3ec107d8984.js","549","static/chunks/549-7b41f257a2531a09.js","787","static/chunks/787-1c7ffb69c49bbba0.js","141","static/chunks/141-4801f5a1522ecf9a.js","218","static/chunks/218-ede9cc2c1bd98df6.js","84","static/chunks/app/%5Blang%5D/layout-7b74e2c6b4205188.js"],""]
10:I[8212,["501","static/chunks/c16f53c3-e0b1a3ec107d8984.js","549","static/chunks/549-7b41f257a2531a09.js","787","static/chunks/787-1c7ffb69c49bbba0.js","141","static/chunks/141-4801f5a1522ecf9a.js","218","static/chunks/218-ede9cc2c1bd98df6.js","84","static/chunks/app/%5Blang%5D/layout-7b74e2c6b4205188.js"],"ClientNavbar"]
12:I[1995,["501","static/chunks/c16f53c3-e0b1a3ec107d8984.js","549","static/chunks/549-7b41f257a2531a09.js","787","static/chunks/787-1c7ffb69c49bbba0.js","141","static/chunks/141-4801f5a1522ecf9a.js","218","static/chunks/218-ede9cc2c1bd98df6.js","84","static/chunks/app/%5Blang%5D/layout-7b74e2c6b4205188.js"],"VersionBadge"]
13:I[530,["501","static/chunks/c16f53c3-e0b1a3ec107d8984.js","549","static/chunks/549-7b41f257a2531a09.js","787","static/chunks/787-1c7ffb69c49bbba0.js","141","static/chunks/141-4801f5a1522ecf9a.js","218","static/chunks/218-ede9cc2c1bd98df6.js","84","static/chunks/app/%5Blang%5D/layout-7b74e2c6b4205188.js"],"LanguageDropdown"]
14:I[7191,["501","static/chunks/c16f53c3-e0b1a3ec107d8984.js","549","static/chunks/549-7b41f257a2531a09.js","787","static/chunks/787-1c7ffb69c49bbba0.js","141","static/chunks/141-4801f5a1522ecf9a.js","218","static/chunks/218-ede9cc2c1bd98df6.js","84","static/chunks/app/%5Blang%5D/layout-7b74e2c6b4205188.js"],"MobileNav"]
15:I[8960,["501","static/chunks/c16f53c3-e0b1a3ec107d8984.js","549","static/chunks/549-7b41f257a2531a09.js","787","static/chunks/787-1c7ffb69c49bbba0.js","141","static/chunks/141-4801f5a1522ecf9a.js","218","static/chunks/218-ede9cc2c1bd98df6.js","84","static/chunks/app/%5Blang%5D/layout-7b74e2c6b4205188.js"],"TOCProvider"]
16:"$Sreact.fragment"
17:I[7191,["501","static/chunks/c16f53c3-e0b1a3ec107d8984.js","549","static/chunks/549-7b41f257a2531a09.js","787","static/chunks/787-1c7ffb69c49bbba0.js","141","static/chunks/141-4801f5a1522ecf9a.js","218","static/chunks/218-ede9cc2c1bd98df6.js","84","static/chunks/app/%5Blang%5D/layout-7b74e2c6b4205188.js"],"Sidebar"]
18:I[2661,["501","static/chunks/c16f53c3-e0b1a3ec107d8984.js","549","static/chunks/549-7b41f257a2531a09.js","787","static/chunks/787-1c7ffb69c49bbba0.js","141","static/chunks/141-4801f5a1522ecf9a.js","218","static/chunks/218-ede9cc2c1bd98df6.js","84","static/chunks/app/%5Blang%5D/layout-7b74e2c6b4205188.js"],"ClientWrapper"]
1a:I[8451,["501","static/chunks/c16f53c3-e0b1a3ec107d8984.js","549","static/chunks/549-7b41f257a2531a09.js","787","static/chunks/787-1c7ffb69c49bbba0.js","141","static/chunks/141-4801f5a1522ecf9a.js","218","static/chunks/218-ede9cc2c1bd98df6.js","84","static/chunks/app/%5Blang%5D/layout-7b74e2c6b4205188.js"],"ToggleWordWrapButton"]
1b:I[6099,["501","static/chunks/c16f53c3-e0b1a3ec107d8984.js","549","static/chunks/549-7b41f257a2531a09.js","787","static/chunks/787-1c7ffb69c49bbba0.js","141","static/chunks/141-4801f5a1522ecf9a.js","218","static/chunks/218-ede9cc2c1bd98df6.js","84","static/chunks/app/%5Blang%5D/layout-7b74e2c6b4205188.js"],"HeadingAnchor"]
11:T481,M12 3C7.0275 3 3 7.12937 3 12.2276C3 16.3109 5.57625 19.7597 9.15374 20.9824C9.60374 21.0631 9.77249 20.7863 9.77249 20.5441C9.77249 20.3249 9.76125 19.5982 9.76125 18.8254C7.5 19.2522 6.915 18.2602 6.735 17.7412C6.63375 17.4759 6.19499 16.6569 5.8125 16.4378C5.4975 16.2647 5.0475 15.838 5.80124 15.8264C6.51 15.8149 7.01625 16.4954 7.18499 16.7723C7.99499 18.1679 9.28875 17.7758 9.80625 17.5335C9.885 16.9337 10.1212 16.53 10.38 16.2993C8.3775 16.0687 6.285 15.2728 6.285 11.7432C6.285 10.7397 6.63375 9.9092 7.20749 9.26326C7.1175 9.03257 6.8025 8.08674 7.2975 6.81794C7.2975 6.81794 8.05125 6.57571 9.77249 7.76377C10.4925 7.55615 11.2575 7.45234 12.0225 7.45234C12.7875 7.45234 13.5525 7.55615 14.2725 7.76377C15.9937 6.56418 16.7475 6.81794 16.7475 6.81794C17.2424 8.08674 16.9275 9.03257 16.8375 9.26326C17.4113 9.9092 17.76 10.7281 17.76 11.7432C17.76 15.2843 15.6563 16.0687 13.6537 16.2993C13.98 16.5877 14.2613 17.1414 14.2613 18.0065C14.2613 19.2407 14.25 20.2326 14.25 20.5441C14.25 20.7863 14.4188 21.0746 14.8688 20.9824C16.6554 20.364 18.2079 19.1866 19.3078 17.6162C20.4077 16.0457 20.9995 14.1611 21 12.2276C21 7.12937 16.9725 3 12 3Z7:["$","$L9",null,{"value":{"children":"$undefined","darkMode":true,"docsRepositoryBase":"https://github.com/alibaba/neug/blob/main/doc","editLink":"Edit this page","feedback":{"content":"Question? Give us feedback","labels":"feedback"},"i18n":[{"locale":"en","name":"English"},{"locale":"zh","name":"中文"}],"lastUpdated":["$","$La",null,{}],"navigation":{"next":true,"prev":true},"search":["$","$Lb",null,{}],"sidebar":{"defaultMenuCollapseLevel":1,"defaultOpen":true,"toggleButton":true,"autoCollapse":true},"themeSwitch":{"dark":"Dark","light":"Light","system":"System"},"toc":{"backToTop":"Scroll to top","float":true,"title":"On This Page"}},"children":["$","$Lc",null,{"attribute":"class","defaultTheme":"light","disableTransitionOnChange":true,"storageKey":"theme","children":[["$","$Ld",null,{}],"$undefined",["$","$Le",null,{"pageMap":[{"data":{"overview":{"title":"概述"},"installation":{"title":"安装"},"getting_started":{"title":"快速开始"},"tutorials":{"title":"教程"},"data_io":{"title":"数据导入导出"},"cypher_manual":{"title":"Cypher 手册"},"extensions":{"title":"扩展"},"transaction":{"title":"事务"},"user_clients":{"title":"用户客户端"},"reference":{"title":"API 参考"},"development":{"title":"开发指南"}}},{"name":"overview","route":"/zh/overview","children":[{"name":"introduction","route":"/zh/overview/introduction","frontMatter":{"title":"介绍","filePath":"content/zh/overview/introduction.md"},"title":"介绍"}],"title":"概述"},{"name":"installation","route":"/zh/installation","children":[{"name":"installation","route":"/zh/installation/installation","frontMatter":{"title":"安装","filePath":"content/zh/installation/installation.md"},"title":"安装"}],"title":"安装"},{"name":"getting_started","route":"/zh/getting_started","children":[{"name":"getting_started","route":"/zh/getting_started/getting_started","frontMatter":{"title":"快速开始","filePath":"content/zh/getting_started/getting_started.md"},"title":"快速开始"},{"name":"neug_ui","route":"/zh/getting_started/neug_ui","frontMatter":{"title":"NeuG Web UI","filePath":"content/zh/getting_started/neug_ui.md"},"title":"NeuG Web UI"}],"title":"快速开始"},{"name":"tutorials","route":"/zh/tutorials","children":[{"name":"tinysnb_tutorial","route":"/zh/tutorials/tinysnb_tutorial","frontMatter":{"title":"使用 NeuG 探索社交网络","filePath":"content/zh/tutorials/tinysnb_tutorial.md"},"title":"使用 NeuG 探索社交网络"}],"title":"教程"},{"name":"data_io","route":"/zh/data_io","children":[{"data":{"index":{"title":"概览"},"load_data":{"title":"加载数据"},"import_data":{"title":"导入数据"},"export_data":{"title":"导出数据"}}},{"name":"index","route":"/zh/data_io","frontMatter":{"title":"概述","filePath":"content/zh/data_io/index.md"},"title":"概览"},{"name":"load_data","route":"/zh/data_io/load_data","frontMatter":{"title":"加载数据","filePath":"content/zh/data_io/load_data.md"},"title":"加载数据"},{"name":"import_data","route":"/zh/data_io/import_data","frontMatter":{"title":"导入数据","filePath":"content/zh/data_io/import_data.md"},"title":"导入数据"},{"name":"export_data","route":"/zh/data_io/export_data","frontMatter":{"title":"导出数据","filePath":"content/zh/data_io/export_data.md"},"title":"导出数据"}],"title":"数据导入导出"},{"name":"cypher_manual","route":"/zh/cypher_manual","children":[{"data":{"data_types":{"title":"数据类型"},"ddl_clause":{"title":"DDL 子句"},"dml_clause":{"title":"DML 子句"},"expression":{"title":"表达式"},"query_clauses":{"title":"查询子句"}}},{"name":"index","route":"/zh/cypher_manual","frontMatter":{"title":"概述","filePath":"content/zh/cypher_manual/index.md"},"title":"概述"},{"name":"data_types","route":"/zh/cypher_manual/data_types","frontMatter":{"title":"数据类型","filePath":"content/zh/cypher_manual/data_types.md"},"title":"数据类型"},{"name":"ddl_clause","route":"/zh/cypher_manual/ddl_clause","frontMatter":{"title":"DDL 子句","filePath":"content/zh/cypher_manual/ddl_clause.md"},"title":"DDL 子句"},{"name":"dml_clause","route":"/zh/cypher_manual/dml_clause","frontMatter":{"title":"DML 子句","filePath":"content/zh/cypher_manual/dml_clause.md"},"title":"DML 子句"},{"name":"expression","route":"/zh/cypher_manual/expression","children":[{"data":{"arithmetic_op":{"title":"算术运算符"},"comparison_op":{"title":"比较运算符"},"logical_op":{"title":"逻辑运算符"},"null_op":{"title":"空值运算符"},"list_op":{"title":"列表运算符"},"cast_func":{"title":"类型转换函数"},"agg_func":{"title":"聚合函数"},"graph_func":{"title":"图函数"},"temporal_func":{"title":"时间函数"}}},{"name":"index","route":"/zh/cypher_manual/expression","frontMatter":{"title":"表达式","filePath":"content/zh/cypher_manual/expression/index.md"},"title":"表达式"},{"name":"arithmetic_op","route":"/zh/cypher_manual/expression/arithmetic_op","frontMatter":{"title":"算术运算符","filePath":"content/zh/cypher_manual/expression/arithmetic_op.md"},"title":"算术运算符"},{"name":"comparison_op","route":"/zh/cypher_manual/expression/comparison_op","frontMatter":{"title":"比较运算符","filePath":"content/zh/cypher_manual/expression/comparison_op.md"},"title":"比较运算符"},{"name":"logical_op","route":"/zh/cypher_manual/expression/logical_op","frontMatter":{"title":"逻辑运算符","filePath":"content/zh/cypher_manual/expression/logical_op.md"},"title":"逻辑运算符"},{"name":"null_op","route":"/zh/cypher_manual/expression/null_op","frontMatter":{"title":"空值操作符","filePath":"content/zh/cypher_manual/expression/null_op.md"},"title":"空值运算符"},{"name":"list_op","route":"/zh/cypher_manual/expression/list_op","frontMatter":{"title":"列表操作符","filePath":"content/zh/cypher_manual/expression/list_op.md"},"title":"列表运算符"},{"name":"cast_func","route":"/zh/cypher_manual/expression/cast_func","frontMatter":{"title":"CAST 函数","filePath":"content/zh/cypher_manual/expression/cast_func.md"},"title":"类型转换函数"},{"name":"agg_func","route":"/zh/cypher_manual/expression/agg_func","frontMatter":{"title":"聚合函数","filePath":"content/zh/cypher_manual/expression/agg_func.md"},"title":"聚合函数"},{"name":"graph_func","route":"/zh/cypher_manual/expression/graph_func","frontMatter":{"title":"图模式函数","filePath":"content/zh/cypher_manual/expression/graph_func.md"},"title":"图函数"},{"name":"temporal_func","route":"/zh/cypher_manual/expression/temporal_func","frontMatter":{"title":"时间函数","filePath":"content/zh/cypher_manual/expression/temporal_func.md"},"title":"时间函数"}],"title":"表达式"},{"name":"query_clauses","route":"/zh/cypher_manual/query_clauses","children":[{"data":{"match_clause":{"title":"MATCH 子句"},"where_clause":{"title":"WHERE 子句"},"return_clause":{"title":"RETURN 子句"},"with_clause":{"title":"WITH 子句"},"order_clause":{"title":"ORDER BY 子句"},"limit_clause":{"title":"LIMIT 子句"},"union_clause":{"title":"UNION 子句"}}},{"name":"index","route":"/zh/cypher_manual/query_clauses","frontMatter":{"title":"查询子句","filePath":"content/zh/cypher_manual/query_clauses/index.md"},"title":"查询子句"},{"name":"match_clause","route":"/zh/cypher_manual/query_clauses/match_clause","frontMatter":{"title":"Match 子句","filePath":"content/zh/cypher_manual/query_clauses/match_clause.md"},"title":"MATCH 子句"},{"name":"where_clause","route":"/zh/cypher_manual/query_clauses/where_clause","frontMatter":{"title":"WHERE 子句","filePath":"content/zh/cypher_manual/query_clauses/where_clause.md"},"title":"WHERE 子句"},{"name":"return_clause","route":"/zh/cypher_manual/query_clauses/return_clause","frontMatter":{"title":"Return 子句","filePath":"content/zh/cypher_manual/query_clauses/return_clause.md"},"title":"RETURN 子句"},{"name":"with_clause","route":"/zh/cypher_manual/query_clauses/with_clause","frontMatter":{"title":"With 子句","filePath":"content/zh/cypher_manual/query_clauses/with_clause.md"},"title":"WITH 子句"},{"name":"order_clause","route":"/zh/cypher_manual/query_clauses/order_clause","frontMatter":{"title":"排序子句","filePath":"content/zh/cypher_manual/query_clauses/order_clause.md"},"title":"ORDER BY 子句"},{"name":"limit_clause","route":"/zh/cypher_manual/query_clauses/limit_clause","frontMatter":{"title":"Limit 子句","filePath":"content/zh/cypher_manual/query_clauses/limit_clause.md"},"title":"LIMIT 子句"},{"name":"union_clause","route":"/zh/cypher_manual/query_clauses/union_clause","frontMatter":{"title":"联合子句","filePath":"content/zh/cypher_manual/query_clauses/union_clause.md"},"title":"UNION 子句"}],"title":"查询子句"},{"name":"extensions","route":"/zh/cypher_manual/extensions","children":[{"name":"load_json","route":"/zh/cypher_manual/extensions/load_json","frontMatter":{"title":"Json 扩展","filePath":"content/zh/cypher_manual/extensions/load_json.md"},"title":"Json 扩展"},{"name":"overview","route":"/zh/cypher_manual/extensions/overview","frontMatter":{"title":"扩展","filePath":"content/zh/cypher_manual/extensions/overview.md"},"title":"扩展"}],"title":"Extensions"},{"name":"load_from","route":"/zh/cypher_manual/load_from","frontMatter":{"title":"从外部加载","filePath":"content/zh/cypher_manual/load_from.md"},"title":"从外部加载"}],"title":"Cypher 手册"},{"name":"extensions","route":"/zh/extensions","children":[{"data":{"index":{"title":"概览"},"load_json":{"title":"JSON 扩展"}}},{"name":"index","route":"/zh/extensions","frontMatter":{"title":"概述","filePath":"content/zh/extensions/index.md"},"title":"概览"},{"name":"load_json","route":"/zh/extensions/load_json","frontMatter":{"title":"JSON 扩展","filePath":"content/zh/extensions/load_json.md"},"title":"JSON 扩展"}],"title":"扩展"},{"name":"transaction","route":"/zh/transaction","children":[{"name":"transaction","route":"/zh/transaction/transaction","frontMatter":{"title":"事务管理","filePath":"content/zh/transaction/transaction.md"},"title":"事务管理"}],"title":"事务"},{"name":"user_clients","route":"/zh/user_clients","children":[{"name":"cli","route":"/zh/user_clients/cli","frontMatter":{"title":"命令行界面（CLI）","filePath":"content/zh/user_clients/cli.md"},"title":"命令行界面（CLI）"}],"title":"用户客户端"},{"name":"reference","route":"/zh/reference","children":[{"data":{"cpp_api":{"title":"C++ API"},"python_api":{"title":"Python API"}}},{"name":"cpp_api","route":"/zh/reference/cpp_api","children":[{"data":{"index":{"title":"C++ API 概述"},"neug_db":{"title":"数据库"},"connection":{"title":"嵌入式连接"},"query_result":{"title":"查询结果"},"service":{"title":"服务"}}},{"name":"index","route":"/zh/reference/cpp_api","frontMatter":{"title":"C++ API 参考","filePath":"content/zh/reference/cpp_api/index.md"},"title":"C++ API 概述"},{"name":"neug_db","route":"/zh/reference/cpp_api/neug_db","frontMatter":{"title":"NeugDB","filePath":"content/zh/reference/cpp_api/neug_db.md"},"title":"数据库"},{"name":"connection","route":"/zh/reference/cpp_api/connection","frontMatter":{"title":"连接","filePath":"content/zh/reference/cpp_api/connection.md"},"title":"嵌入式连接"},{"name":"query_result","route":"/zh/reference/cpp_api/query_result","frontMatter":{"title":"QueryResult","filePath":"content/zh/reference/cpp_api/query_result.md"},"title":"查询结果"},{"name":"service","route":"/zh/reference/cpp_api/service","frontMatter":{"title":"NeugDBService","filePath":"content/zh/reference/cpp_api/service.md"},"title":"服务"}],"title":"C++ API"},{"name":"python_api","route":"/zh/reference/python_api","children":[{"data":{"index":{"title":"Python API 概述"},"database":{"title":"主数据库接口"},"connection":{"title":"数据库连接"},"session":{"title":"会话管理"},"query_result":{"title":"查询执行结果"}}},{"name":"index","route":"/zh/reference/python_api","frontMatter":{"title":"Python API 参考","filePath":"content/zh/reference/python_api/index.md"},"title":"Python API 概述"},{"name":"database","route":"/zh/reference/python_api/database","frontMatter":{"title":"模块 neug.database","filePath":"content/zh/reference/python_api/database.md"},"title":"主数据库接口"},{"name":"connection","route":"/zh/reference/python_api/connection","frontMatter":{"title":"模块 neug.connection","filePath":"content/zh/reference/python_api/connection.md"},"title":"数据库连接"},{"name":"session","route":"/zh/reference/python_api/session","frontMatter":{"title":"模块 neug.session","filePath":"content/zh/reference/python_api/session.md"},"title":"会话管理"},{"name":"query_result","route":"/zh/reference/python_api/query_result","frontMatter":{"title":"模块 neug.query_result","filePath":"content/zh/reference/python_api/query_result.md"},"title":"查询执行结果"}],"title":"Python API"}],"title":"API 参考"},{"name":"development","route":"/zh/development","children":[{"name":"ai_coding","route":"/zh/development/ai_coding","frontMatter":{"title":"AI 辅助开发","filePath":"content/zh/development/ai_coding.md"},"title":"AI 辅助开发"},{"name":"code_style_guide","route":"/zh/development/code_style_guide","frontMatter":{"title":"代码风格指南","filePath":"content/zh/development/code_style_guide.md"},"title":"代码风格指南"},{"name":"dev_guide","route":"/zh/development/dev_guide","frontMatter":{"title":"开发者指南","filePath":"content/zh/development/dev_guide.md"},"title":"开发者指南"},{"name":"error_code","route":"/zh/development/error_code","frontMatter":{"title":"NeuG 错误码","filePath":"content/zh/development/error_code.md"},"title":"NeuG 错误码"}],"title":"开发指南"}],"navbar":["$","header",null,{"className":"nextra-navbar x:sticky x:top-0 x:z-30 x:w-full x:bg-transparent x:print:hidden x:max-md:[.nextra-banner:not([class$=hidden])~&]:top-(--nextra-banner-height)","children":[["$","div",null,{"className":"nextra-navbar-blur x:absolute x:-z-1 x:size-full nextra-border x:border-b x:backdrop-blur-md x:bg-nextra-bg/70"}],["$","nav",null,{"style":{"height":"var(--nextra-navbar-height)"},"className":"x:mx-auto x:flex x:max-w-(--nextra-content-width) x:items-center x:gap-4 x:pl-[max(env(safe-area-inset-left),1.5rem)] x:pr-[max(env(safe-area-inset-right),1.5rem)] x:justify-end","children":[["$","$Lf",null,{"href":"/","className":"x:flex x:items-center x:me-auto x:transition-opacity x:focus-visible:nextra-focus x:hover:opacity-75","aria-label":"Home page","children":["$","span",null,{"className":"ms-2 select-none font-extrabold flex items-center","title":"NeuG: HTAP Graph Database","children":[["$","img",null,{"src":"https://img.alicdn.com/imgextra/i3/O1CN01DaSVLB1lD7ZIbDOi2_!!6000000004784-2-tps-256-257.png","alt":"GraphScope Neug","width":32,"height":32,"className":"inline-block align-middle mr-2 ","style":{"verticalAlign":"middle"}}],["$","span",null,{"className":"text-lg font-bold align-middle text-gray-900 dark:text-white","children":"NeuG"}]]}]}],["$","$L10",null,{"className":"","children":[["$","a",null,{"href":"https://github.com/alibaba/neug","target":"_blank","rel":"noreferrer","children":[["$","svg",null,{"fill":"currentColor","viewBox":"3 3 18 18","height":"24","aria-label":"Project repository","children":["$","path",null,{"d":"$11"}]}],false],"className":"x:focus-visible:nextra-focus"}],"$undefined",[["$","$L12",null,{}],["$","$L13",null,{"currentLang":"zh"}]]]}]]}]]}],"footer":null,"children":[["$","$L14",null,{}],["$","$L3",null,{"parallelRouterKey":"children","segmentPath":["children","$4","children"],"error":"$undefined","errorStyles":"$undefined","errorScripts":"$undefined","template":["$","$L6",null,{}],"templateStyles":"$undefined","templateScripts":"$undefined","notFound":"$undefined","notFoundStyles":"$undefined"}]]}]]}]}]
19:T2164,# Data Types

This document provides a comprehensive overview of all data types supported by NeuG.

## Data Types Summary Table

The following table showcases all data types supported by NeuG and their differences with Neo4j. The `System Default Value` column indicates the value automatically assigned by the system during data import when the user does not explicitly define a default value in the schema and the corresponding data field is not given (or given as `Null` value) in the raw data. This mechanism prevents `Null` values, ensures data consistency, and provides stable defaults for subsequent queries and computations.

| Category | Type | System Default value | NeuG Example | Neo4j Example |
|----------|------|---------------------|--------------|---------------|
| Primitive | INT32 | `0` | `Return CAST(42, 'INT32')` | `Return 42` |
| Primitive | UINT32 | `0` | `Return CAST(42, 'UINT32')` | unsupported |
| Primitive | INT64 | `0` | `Return 9223372036854775807` | `Return 9223372036854775807` |
| Primitive | UINT64 | `0` | `Return CAST(9223372036854775807, 'UINT64')` | unsupported |
| Primitive | FLOAT | `0.0` | `Return CAST(3.14, 'FLOAT')` | `Return 3.14f` |
| Primitive | DOUBLE | `0.0` | `Return 3.14159265359` | `Return 3.14159265359d` |
| Primitive | BOOL | `false` | `Return true` | `Return true` |
| Primitive | NULL | `null` | `Return null` | `Return null` |
| String | VARCHAR | `''` (empty string) | `Return 'Hello World'` | `Return 'Hello World'` |
| Temporal | DATE | `1970-01-01` | `Return date('2022-06-06')` | `Return date('2022-06-06')` |
| Temporal | DATETIME | `1970-01-01 00:00:00` | `Return timestamp('2022-06-06 12:00:00')` | `Return datetime('2022-06-06T12:00:00')` |
| Temporal | INTERVAL | `0 year 0 month 0 day` (zero interval) | `RETURN interval('1 year 2 month 3 day')` | `Return duration('P1Y2M3D')` |
| Composite | LIST | `[]` (empty list) | `Return [1, 2, 3]` | `Return [1, 2, 3]` |
| Pattern | NODE | `{}` (empty node) | `{_ID: 0, _LABEL: person, id: 1, name: marko, age: 29}` | `(:person {name: 'Alice', age: 30})` |
| Pattern | REL | `{}` (empty edge) | `{_ID: 2, _LABEL: knows, _SRC_LABEL: person, _DST_LABEL: person, _SRC_ID: 0, _DST_ID: 2, weight: 1.0}` | `[:knows {weight: 1.0}]` |
| Pattern | REPEATED PATH | `[]` (empty path) | `{_ID: 0, _LABEL: person}, {_ID: 4294967298, _LABEL: created, _SRC_LABEL: person, _DST_LABEL: person, _SRC_ID: 0, _DST_ID: 2}, {_ID: 2, _LABEL: person}, {_ID: 4297064449, _LABEL: created, _SRC_LABEL: person, _DST_LABEL: software, _SRC_ID: 2, _DST_ID: 72057594037927937}, {_ID: 72057594037927937, _LABEL: software}` | `(:Person {name: "Kiefer", id: 4, age: 1992})-[:FOLLOWS]->(:Person {name: "Jack", id: 3, age: 1979})-[:FOLLOWS]->(:Person {name: "Kevin", id: 5, age: 1997})` |

## Detailed Introduction

### Primitive Types

#### INT32
- **Description**: 32-bit signed integer type
- **Range**: [2,147,483,648, 2,147,483,647]
- **Query Example**: `Return CAST(42, 'INT32') as int32_value;`

#### UINT32
- **Description**: 32-bit unsigned integer type
- **Range**: [0, 4,294,967,295]
- **Query Example**: `RETURN CAST(42, 'UINT32') AS uint32_value;`

#### INT64
- **Description**: 64-bit signed integer type, default type of integer values
- **Range**: [-9,223,372,036,854,775,808, 9,223,372,036,854,775,807]
- **Query Example**: `RETURN 9223372036854775807 AS int64_value;`

#### UINT64
- **Description**: 64-bit unsigned integer type
- **Range**: [0, 18,446,744,073,709,551,615]
- **Query Example**: `RETURN CAST(18446744073709551615, 'UINT64') AS uint64_value;`

#### FLOAT
- **Description**: Single-precision floating-point number
- **Precision**: ~7 decimal digits
- **Query Example**: `RETURN CAST(3.14, 'FLOAT') AS float_value;`

#### DOUBLE
- **Description**: Double-precision floating-point number, default type of float values
- **Precision**: ~15-17 decimal digits
- **Query Example**: `RETURN 3.14159265359 AS double_value;`

#### BOOL
- **Description**: Boolean type representing true or false values
- **Values**: `true`, `false`
- **Query Example**: `RETURN true AS bool_value;`

#### NULL
- **Description**: Represents missing or undefined values
- **Query Example**: `RETURN null AS null_value;`

### String Types

#### VARCHAR
- **Description**: Variable-length character string with UTF-8 encoding
- **Query Example**: `RETURN 'Hello World' AS string_value;`
- **Length**: Variable, limited by system constraints, default is `65536`

### Temporal Types

#### DATE
- **Description**: Date type for storing calendar dates
- **Format**: YYYY-MM-DD
- **Query Example**: `RETURN date('2022-06-06') AS date_value;`

#### DATETIME
- **Description**: Combination of date and time type
- **Format**: YYYY-MM-DD HH:MM:SS
- **Query Example**: `RETURN timestamp('2022-06-06 12:00:00') AS datetime_value;`

#### INTERVAL
- **Description**: The INTERVAL type represents a duration or time interval and consists of the following fields: `year`, `month`, `day`, `hour`, `minute`, `second`, `millisecond`, and `microsecond` . The INTERVAL type supports two primary formats for specifying values: 
    - Date-based components (year, month, day): Specified using a natural language format. Example: `1 year 2 month 3 day`.
    - Time-based components (hour, minute, second, millisecond, microsecond): Specified using a natural language format. Example: `12 hour 12 minute 2 second` - represents 12 hours, 12 minutes, and 2 seconds.
- **Query Example**: `RETURN interval('1 year 2 month 3 day 12 hour 12 minute 2 second') AS interval_value;`

### Composite Types

#### LIST
- **Description**: Ordered collection of values with heterogeneous types
- **Query Example**: `RETURN [1, 2, 3] AS list_value;`

The following table shows all Component Types that LIST can support:

| Category | Type | Example |
|----------|------|---------|
| Numeric | INT32, INT64, UINT32, UINT64, DOUBLE, FLOAT | `RETURN [1, 2, 3.0];` |
| String | VARCHAR | `RETURN ['marko', 'josh'];` |
| Date | DATE, DATETIME | `RETURN [date('2011-01-25'), timestamp('2011-01-25 11:20:33')];` |
| BOOL | BOOL | `RETURN [true, false];` |
| Composite | LIST | `RETURN [[1, 2], [4, 5]];` |

**Important Note on LIST Component Types**: 

NeuG supports lists through tuple data types, meaning composite types can be heterogeneous. Here are some examples:

Mixing different primitive types in a single list:
```cypher
RETURN ['marko', 2];
```

Combining different property types from nodes in a list:
```cypher
MATCH (n:person) RETURN [n.name, n.age];
```

Supporting nested list structures:
```cypher
MATCH (n:person) RETURN [["name", n.name], ["age", n.age]];
```

**Key Technical Details:**
- Lists in NeuG can contain elements of different data types (heterogeneous lists)
- This is achieved through internal tuple data type support
- Type conversion is handled automatically when possible
- Nested lists are fully supported for complex data structures
- The system maintains type safety while allowing flexibility in list composition

### Graph Types

#### NODE
- **Description**: Represents a node in the graph
- **Internal Structure** (order is insignificant): `_ID` (internal identifier), `_LABEL` (indication of node type) and property fields
- **Query Example**: `MATCH (n:person) RETURN n AS node_value;`
- **NeuG Format**: `{_ID: 0, _LABEL: person, id: 1, name: marko, age: 29}`

#### REL (Edge)
- **Description**: Represents an edge in the graph
- **Internal Structure** (order is insignificant): `_ID` (edge internal identifier),  `_LABEL` (indication of edge type), `_SRC_ID` (internal identifier of source node), `_SRC_LABEL` (label of source node), `_DST_ID` (internal identifier of destination node), `_DST_LABEL` (label of destination node), and property fields
- **Query Example**: `MATCH ()-[r:knows]->() RETURN r AS rel_value;`
- **NeuG Format**: `{_ID: 2, _LABEL: knows, _SRC_ID: 0, _SRC_LABEL: person, _DST_ID: 2, _DST_LABEL: person, weight: 1.0}`

#### PATH
- **Description**:  Represents a graph path formed by alternating nodes and edges.
- **Internal Structure**: An **ordered sequence** of nodes and edges along the path, including the starting and ending nodes.
- **Query Example**: `MATCH (a:person)-[p*1..2]->(c) RETURN p AS path_value;`
- **NeuG Format**: `{_ID: 0, _LABEL: person}, {_ID: 4294967298, _LABEL: created, _SRC_LABEL: person, _DST_LABEL: person, _SRC_ID: 0, _DST_ID: 2}, {_ID: 2, _LABEL: person}, {_ID: 4297064449, _LABEL: created, _SRC_LABEL: person, _DST_LABEL: software, _SRC_ID: 2, _DST_ID: 72057594037927937}, {_ID: 72057594037927937, _LABEL: software}`2:["$","div",null,{"className":"x:mx-auto x:flex x:max-w-(--nextra-content-width)","children":["$","$L15",null,{"value":[{"value":"公共方法","id":"公共方法","depth":3},{"value":[["$","$16",".0",{"children":[["$","code",null,{"className":"nextra-code","dir":"ltr","children":"Query(...)"}]]}]],"id":"query","depth":4},{"value":[["$","$16",".0",{"children":[["$","code",null,{"className":"nextra-code","dir":"ltr","children":"Query(...)"}]]}]],"id":"query-1","depth":4},{"value":[["$","$16",".0",{"children":[["$","code",null,{"className":"nextra-code","dir":"ltr","children":"GetSchema() const"}]]}]],"id":"getschema-const","depth":4},{"value":[["$","$16",".0",{"children":[["$","code",null,{"className":"nextra-code","dir":"ltr","children":"Close()"}]]}]],"id":"close","depth":4},{"value":[["$","$16",".0",{"children":[["$","code",null,{"className":"nextra-code","dir":"ltr","children":"IsClosed() const"}]]}]],"id":"isclosed-const","depth":4}],"children":[["$","$L17",null,{}],["$","$L18",null,{"metadata":{"title":"连接","filePath":"content/zh/reference/cpp_api/connection.md"},"bottomContent":"$undefined","sourceCode":"$19","children":[["$","div",null,{"id":"nextra-skip-nav"}],["$","main",null,{"data-pagefind-body":true,"children":[["$","h1",null,{"id":"$undefined","className":"x:tracking-tight x:text-slate-900 x:dark:text-slate-100 x:font-bold x:mt-2 x:text-4xl","children":["连接","$undefined"]}],"\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":[["$","strong",null,{"children":"全名："}]," ",["$","code",null,{"className":"nextra-code","dir":"ltr","children":"neug::Connection"}]]}],"\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":"用于执行 Cypher 查询的数据库连接。"}],"\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":[["$","code",null,{"className":"nextra-code","dir":"ltr","children":"Connection"}]," 是与 NeuG 数据库交互的主要接口。它提供了执行 Cypher 查询、检索模式信息以及管理连接生命周期的方法。"]}],"\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":["$","strong",null,{"children":"使用示例："}]}],"\n",["$","div",null,{"data-pagefind-ignore":"all","className":"nextra-code x:relative x:not-first:mt-[1.25em]","children":["$undefined",["$","pre",null,{"className":"x:group x:focus-visible:nextra-focus x:overflow-x-auto x:subpixel-antialiased x:text-[.9em] x:bg-white x:dark:bg-black x:py-4 x:ring-1 x:ring-inset x:ring-gray-300 x:dark:ring-neutral-700 x:contrast-more:ring-gray-900 x:contrast-more:dark:ring-gray-50 x:contrast-more:contrast-150 x:rounded-md not-prose","tabIndex":"0","children":[["$","div",null,{"className":"x:group-hover:opacity-100 x:group-focus:opacity-100 x:opacity-0 x:transition x:focus-within:opacity-100 x:flex x:gap-1 x:absolute x:right-4 x:top-2","children":[["$","$L1a",null,{"children":["$","svg",null,{"viewBox":"0 0 24 24","fill":"currentColor","height":"1em","children":["$","path",null,{"d":"M4 19h6v-2H4v2zM20 5H4v2h16V5zm-3 6H4v2h13.25c1.1 0 2 .9 2 2s-.9 2-2 2H15v-2l-3 3l3 3v-2h2c2.21 0 4-1.79 4-4s-1.79-4-4-4z"}]}]}],false]}],["$","code",null,{"className":"nextra-code","dir":"ltr","children":[["$","span",null,{"children":["$","span",null,{"style":{"--shiki-light":"#6A737D","--shiki-dark":"#6A737D"},"children":"// 从数据库获取连接"}]}],"\n",["$","span",null,{"children":[["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"auto"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":" conn "}],["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"="}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":" db."}],["$","span",null,{"style":{"--shiki-light":"#6F42C1","--shiki-dark":"#B392F0"},"children":"Connect"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"();"}]]}],"\n",["$","span",null,{"children":["$","span",null,{"style":{"--shiki-light":"#6A737D","--shiki-dark":"#6A737D"},"children":"// 执行读取查询"}]}],"\n",["$","span",null,{"children":[["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"auto"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":" result "}],["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"="}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":" conn->"}],["$","span",null,{"style":{"--shiki-light":"#6F42C1","--shiki-dark":"#B392F0"},"children":"Query"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"("}],["$","span",null,{"style":{"--shiki-light":"#032F62","--shiki-dark":"#9ECBFF"},"children":"\"MATCH (n:Person) RETURN n.name LIMIT 10\""}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":", "}],["$","span",null,{"style":{"--shiki-light":"#032F62","--shiki-dark":"#9ECBFF"},"children":"\"read\""}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":");"}]]}],"\n",["$","span",null,{"children":[["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"for"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":" ("}],["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"auto&"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":" record : result."}],["$","span",null,{"style":{"--shiki-light":"#6F42C1","--shiki-dark":"#B392F0"},"children":"value"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"()) {"}]]}],"\n",["$","span",null,{"children":["$","span",null,{"style":{"--shiki-light":"#6A737D","--shiki-dark":"#6A737D"},"children":"  // 处理记录..."}]}],"\n",["$","span",null,{"children":["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"}"}]}],"\n",["$","span",null,{"children":["$","span",null,{"style":{"--shiki-light":"#6A737D","--shiki-dark":"#6A737D"},"children":"// 执行插入查询"}]}],"\n",["$","span",null,{"children":[["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"conn->"}],["$","span",null,{"style":{"--shiki-light":"#6F42C1","--shiki-dark":"#B392F0"},"children":"Query"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"("}],["$","span",null,{"style":{"--shiki-light":"#032F62","--shiki-dark":"#9ECBFF"},"children":"\"CREATE (p:Person {name: 'Alice', age: 30})\""}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":", "}],["$","span",null,{"style":{"--shiki-light":"#032F62","--shiki-dark":"#9ECBFF"},"children":"\"insert\""}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":");"}]]}],"\n",["$","span",null,{"children":["$","span",null,{"style":{"--shiki-light":"#6A737D","--shiki-dark":"#6A737D"},"children":"// 完成后关闭连接"}]}],"\n",["$","span",null,{"children":[["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"conn->"}],["$","span",null,{"style":{"--shiki-light":"#6F42C1","--shiki-dark":"#B392F0"},"children":"Close"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"();"}]]}]]}]]}]]}],"\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":["$","strong",null,{"children":"访问模式："}]}],"\n",["$","ul",null,{"className":"x:[:is(ol,ul)_&]:my-[.75em] x:not-first:mt-[1.25em] x:list-disc x:ms-[1.5em]","children":["\n",["$","li",null,{"className":"x:my-[.5em]","children":[["$","code",null,{"className":"nextra-code","dir":"ltr","children":"\"read\""}]," 或 ",["$","code",null,{"className":"nextra-code","dir":"ltr","children":"\"r\""}],"：只读查询（MATCH, RETURN）"]}],"\n",["$","li",null,{"className":"x:my-[.5em]","children":[["$","code",null,{"className":"nextra-code","dir":"ltr","children":"\"insert\""}]," 或 ",["$","code",null,{"className":"nextra-code","dir":"ltr","children":"\"i\""}],"：仅插入操作（CREATE）"]}],"\n",["$","li",null,{"className":"x:my-[.5em]","children":[["$","code",null,{"className":"nextra-code","dir":"ltr","children":"\"update\""}]," 或 ",["$","code",null,{"className":"nextra-code","dir":"ltr","children":"\"u\""}],"：更新/删除操作（SET, DELETE, MERGE）"]}],"\n",["$","li",null,{"className":"x:my-[.5em]","children":[["$","code",null,{"className":"nextra-code","dir":"ltr","children":"\"schema\""}]," 或 ",["$","code",null,{"className":"nextra-code","dir":"ltr","children":"\"s\""}],"：",["$","code",null,{"className":"nextra-code","dir":"ltr","children":"Schema"}]," 修改操作（CREATE/DROP 标签）"]}],"\n"]}],"\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":[["$","strong",null,{"children":"线程安全："}]," 此类不是线程安全的。每个线程应使用自己的 ",["$","code",null,{"className":"nextra-code","dir":"ltr","children":"Connection"}]," 实例。使用 ",["$","code",null,{"className":"nextra-code","dir":"ltr","children":"NeugDB::Connect()"}]," 创建连接。"]}],"\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":["$","strong",null,{"children":"生命周期："}]}],"\n",["$","ul",null,{"className":"x:[:is(ol,ul)_&]:my-[.75em] x:not-first:mt-[1.25em] x:list-disc x:ms-[1.5em]","children":["\n",["$","li",null,{"className":"x:my-[.5em]","children":["通过 ",["$","code",null,{"className":"nextra-code","dir":"ltr","children":"NeugDB::Connect()"}]," 创建"]}],"\n",["$","li",null,{"className":"x:my-[.5em]","children":["通过 ",["$","code",null,{"className":"nextra-code","dir":"ltr","children":"Query()"}]," 方法执行查询"]}],"\n",["$","li",null,{"className":"x:my-[.5em]","children":["通过 ",["$","code",null,{"className":"nextra-code","dir":"ltr","children":"Close()"}]," 或析构函数中的自动清理关闭"]}],"\n"]}],"\n",["$","h3",null,{"id":"公共方法","className":"x:tracking-tight x:text-slate-900 x:dark:text-slate-100 x:font-semibold x:target:animate-[fade-in_1.5s] x:mt-8 x:text-2xl","children":["公共方法",["$","$L1b",null,{"id":"公共方法"}]]}],"\n",["$","h4",null,{"id":"query","className":"x:tracking-tight x:text-slate-900 x:dark:text-slate-100 x:font-semibold x:target:animate-[fade-in_1.5s] x:mt-8 x:text-xl","children":[["$","code",null,{"className":"nextra-code","dir":"ltr","children":"Query(...)"}],["$","$L1b",null,{"id":"query"}]]}],"\n",["$","div",null,{"data-pagefind-ignore":"all","className":"nextra-code x:relative x:not-first:mt-[1.25em]","children":["$undefined",["$","pre",null,{"className":"x:group x:focus-visible:nextra-focus x:overflow-x-auto x:subpixel-antialiased x:text-[.9em] x:bg-white x:dark:bg-black x:py-4 x:ring-1 x:ring-inset x:ring-gray-300 x:dark:ring-neutral-700 x:contrast-more:ring-gray-900 x:contrast-more:dark:ring-gray-50 x:contrast-more:contrast-150 x:rounded-md not-prose","tabIndex":"0","children":[["$","div",null,{"className":"x:group-hover:opacity-100 x:group-focus:opacity-100 x:opacity-0 x:transition x:focus-within:opacity-100 x:flex x:gap-1 x:absolute x:right-4 x:top-2","children":[["$","$L1a",null,{"children":["$","svg",null,{"viewBox":"0 0 24 24","fill":"currentColor","height":"1em","children":["$","path",null,{"d":"M4 19h6v-2H4v2zM20 5H4v2h16V5zm-3 6H4v2h13.25c1.1 0 2 .9 2 2s-.9 2-2 2H15v-2l-3 3l3 3v-2h2c2.21 0 4-1.79 4-4s-1.79-4-4-4z"}]}]}],false]}],["$","code",null,{"className":"nextra-code","dir":"ltr","children":[["$","span",null,{"children":[["$","span",null,{"style":{"--shiki-light":"#6F42C1","--shiki-dark":"#B392F0"},"children":"Query"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"("}]]}],"\n",["$","span",null,{"children":[["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"    const"}],["$","span",null,{"style":{"--shiki-light":"#6F42C1","--shiki-dark":"#B392F0"},"children":" std"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"::string "}],["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"&"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"query_string,"}]]}],"\n",["$","span",null,{"children":[["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"    const"}],["$","span",null,{"style":{"--shiki-light":"#6F42C1","--shiki-dark":"#B392F0"},"children":" std"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"::string "}],["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"&"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"access_mode"}],["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"="}],["$","span",null,{"style":{"--shiki-light":"#032F62","--shiki-dark":"#9ECBFF"},"children":"\"update\""}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":","}]]}],"\n",["$","span",null,{"children":[["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"    const"}],["$","span",null,{"style":{"--shiki-light":"#6F42C1","--shiki-dark":"#B392F0"},"children":" execution"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"::ParamsMap "}],["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"&"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"parameters"}],["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"="}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"{}"}]]}],"\n",["$","span",null,{"children":["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":")"}]}]]}]]}]]}],"\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":"执行一个 Cypher 查询并返回结果。"}],"\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":"针对数据库编译和执行一个 Cypher 查询字符串。查询通过规划器进行优化处理，然后由查询处理器执行。"}],"\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":["$","strong",null,{"children":"使用示例："}]}],"\n",["$","div",null,{"data-pagefind-ignore":"all","className":"nextra-code x:relative x:not-first:mt-[1.25em]","children":["$undefined",["$","pre",null,{"className":"x:group x:focus-visible:nextra-focus x:overflow-x-auto x:subpixel-antialiased x:text-[.9em] x:bg-white x:dark:bg-black x:py-4 x:ring-1 x:ring-inset x:ring-gray-300 x:dark:ring-neutral-700 x:contrast-more:ring-gray-900 x:contrast-more:dark:ring-gray-50 x:contrast-more:contrast-150 x:rounded-md not-prose","tabIndex":"0","children":[["$","div",null,{"className":"x:group-hover:opacity-100 x:group-focus:opacity-100 x:opacity-0 x:transition x:focus-within:opacity-100 x:flex x:gap-1 x:absolute x:right-4 x:top-2","children":[["$","$L1a",null,{"children":["$","svg",null,{"viewBox":"0 0 24 24","fill":"currentColor","height":"1em","children":["$","path",null,{"d":"M4 19h6v-2H4v2zM20 5H4v2h16V5zm-3 6H4v2h13.25c1.1 0 2 .9 2 2s-.9 2-2 2H15v-2l-3 3l3 3v-2h2c2.21 0 4-1.79 4-4s-1.79-4-4-4z"}]}]}],false]}],["$","code",null,{"className":"nextra-code","dir":"ltr","children":[["$","span",null,{"children":["$","span",null,{"style":{"--shiki-light":"#6A737D","--shiki-dark":"#6A737D"},"children":"// 简单读取查询"}]}],"\n",["$","span",null,{"children":[["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"auto"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":" result "}],["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"="}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":" conn->"}],["$","span",null,{"style":{"--shiki-light":"#6F42C1","--shiki-dark":"#B392F0"},"children":"Query"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"("}],["$","span",null,{"style":{"--shiki-light":"#032F62","--shiki-dark":"#9ECBFF"},"children":"\"MATCH (n:Person) RETURN n.name\""}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":", "}],["$","span",null,{"style":{"--shiki-light":"#032F62","--shiki-dark":"#9ECBFF"},"children":"\"read\""}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":");"}]]}],"\n",["$","span",null,{"children":["$","span",null,{"style":{"--shiki-light":"#6A737D","--shiki-dark":"#6A737D"},"children":"// 带参数的查询"}]}],"\n",["$","span",null,{"children":[["$","span",null,{"style":{"--shiki-light":"#6F42C1","--shiki-dark":"#B392F0"},"children":"neug"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"::"}],["$","span",null,{"style":{"--shiki-light":"#6F42C1","--shiki-dark":"#B392F0"},"children":"execution"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"::ParamsMap params;"}]]}],"\n",["$","span",null,{"children":[["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"params["}],["$","span",null,{"style":{"--shiki-light":"#032F62","--shiki-dark":"#9ECBFF"},"children":"\"min_age\""}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"] "}],["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"="}],["$","span",null,{"style":{"--shiki-light":"#6F42C1","--shiki-dark":"#B392F0"},"children":" neug"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"::"}],["$","span",null,{"style":{"--shiki-light":"#6F42C1","--shiki-dark":"#B392F0"},"children":"execution"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"::"}],["$","span",null,{"style":{"--shiki-light":"#6F42C1","--shiki-dark":"#B392F0"},"children":"Value"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"("}],["$","span",null,{"style":{"--shiki-light":"#005CC5","--shiki-dark":"#79B8FF"},"children":"18"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":");"}]]}],"\n",["$","span",null,{"children":[["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"result "}],["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"="}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":" conn->"}],["$","span",null,{"style":{"--shiki-light":"#6F42C1","--shiki-dark":"#B392F0"},"children":"Query"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"("}],["$","span",null,{"style":{"--shiki-light":"#032F62","--shiki-dark":"#9ECBFF"},"children":"\"MATCH (p:Person) WHERE p.age > $min_age RETURN p\""}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":","}]]}],"\n",["$","span",null,{"children":[["$","span",null,{"style":{"--shiki-light":"#032F62","--shiki-dark":"#9ECBFF"},"children":"\"read\""}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":", params);"}]]}],"\n",["$","span",null,{"children":["$","span",null,{"style":{"--shiki-light":"#6A737D","--shiki-dark":"#6A737D"},"children":"// 处理结果"}]}],"\n",["$","span",null,{"children":[["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"if"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":" (result."}],["$","span",null,{"style":{"--shiki-light":"#6F42C1","--shiki-dark":"#B392F0"},"children":"has_value"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"()) {"}]]}],"\n",["$","span",null,{"children":[["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"  for"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":" ("}],["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"auto&"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":" record : result."}],["$","span",null,{"style":{"--shiki-light":"#6F42C1","--shiki-dark":"#B392F0"},"children":"value"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"()) {"}]]}],"\n",["$","span",null,{"children":["$","span",null,{"style":{"--shiki-light":"#6A737D","--shiki-dark":"#6A737D"},"children":"    // 通过 record.entries() 访问列"}]}],"\n",["$","span",null,{"children":["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"  }"}]}],"\n",["$","span",null,{"children":[["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"} "}],["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"else"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":" {"}]]}],"\n",["$","span",null,{"children":[["$","span",null,{"style":{"--shiki-light":"#6F42C1","--shiki-dark":"#B392F0"},"children":"  std"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"::cerr "}],["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"<<"}],["$","span",null,{"style":{"--shiki-light":"#032F62","--shiki-dark":"#9ECBFF"},"children":" \"Query failed: \""}],["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":" <<"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":" result."}],["$","span",null,{"style":{"--shiki-light":"#6F42C1","--shiki-dark":"#B392F0"},"children":"error"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"()."}],["$","span",null,{"style":{"--shiki-light":"#6F42C1","--shiki-dark":"#B392F0"},"children":"message"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"() "}],["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"<<"}],["$","span",null,{"style":{"--shiki-light":"#6F42C1","--shiki-dark":"#B392F0"},"children":" std"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"::endl;"}]]}],"\n",["$","span",null,{"children":["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"}"}]}]]}]]}]]}],"\n",["$","ul",null,{"className":"x:[:is(ol,ul)_&]:my-[.75em] x:not-first:mt-[1.25em] x:list-disc x:ms-[1.5em]","children":["\n",["$","li",null,{"className":"x:my-[.5em]","children":["\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":["$","strong",null,{"children":"参数："}]}],"\n",["$","ul",null,{"className":"x:[:is(ol,ul)_&]:my-[.75em] x:not-first:mt-[1.25em] x:list-disc x:ms-[1.5em]","children":["\n",["$","li",null,{"className":"x:my-[.5em]","children":[["$","code",null,{"className":"nextra-code","dir":"ltr","children":"query_string"}],": 要执行的 Cypher 查询"]}],"\n",["$","li",null,{"className":"x:my-[.5em]","children":[["$","code",null,{"className":"nextra-code","dir":"ltr","children":"access_mode"}],": 查询访问模式："]}],"\n"]}],"\n"]}],"\n",["$","li",null,{"className":"x:my-[.5em]","children":["\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":[["$","code",null,{"className":"nextra-code","dir":"ltr","children":"\"read\""}]," 或 ",["$","code",null,{"className":"nextra-code","dir":"ltr","children":"\"r\""}],": 只读操作"]}],"\n"]}],"\n",["$","li",null,{"className":"x:my-[.5em]","children":["\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":[["$","code",null,{"className":"nextra-code","dir":"ltr","children":"\"insert\""}]," 或 ",["$","code",null,{"className":"nextra-code","dir":"ltr","children":"\"i\""}],": 仅插入操作（CREATE）"]}],"\n"]}],"\n",["$","li",null,{"className":"x:my-[.5em]","children":["\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":[["$","code",null,{"className":"nextra-code","dir":"ltr","children":"\"update\""}]," 或 ",["$","code",null,{"className":"nextra-code","dir":"ltr","children":"\"u\""}],": 更新/删除操作（默认）"]}],"\n"]}],"\n",["$","li",null,{"className":"x:my-[.5em]","children":["\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":[["$","code",null,{"className":"nextra-code","dir":"ltr","children":"\"schema\""}]," 或 ",["$","code",null,{"className":"nextra-code","dir":"ltr","children":"\"s\""}],": ",["$","code",null,{"className":"nextra-code","dir":"ltr","children":"Schema"}]," 修改操作"]}],"\n",["$","ul",null,{"className":"x:[:is(ol,ul)_&]:my-[.75em] x:not-first:mt-[1.25em] x:list-disc x:ms-[1.5em]","children":["\n",["$","li",null,{"className":"x:my-[.5em]","children":[["$","code",null,{"className":"nextra-code","dir":"ltr","children":"parameters"}],": 参数化查询的命名参数。键是参数名（不带 ",["$","code",null,{"className":"nextra-code","dir":"ltr","children":"$$"}],"），值是参数值。"]}],"\n"]}],"\n"]}],"\n",["$","li",null,{"className":"x:my-[.5em]","children":["\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":["$","strong",null,{"children":"注意事项："}]}],"\n",["$","ul",null,{"className":"x:[:is(ol,ul)_&]:my-[.75em] x:not-first:mt-[1.25em] x:list-disc x:ms-[1.5em]","children":["\n",["$","li",null,{"className":"x:my-[.5em]","children":"对于动态值使用参数化查询以防止注入。"}],"\n",["$","li",null,{"className":"x:my-[.5em]","children":"指定正确的 access_mode 以确保适当的事务处理。"}],"\n"]}],"\n"]}],"\n",["$","li",null,{"className":"x:my-[.5em]","children":["\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":[["$","strong",null,{"children":"返回："}]," 包含以下内容的 ",["$","code",null,{"className":"nextra-code","dir":"ltr","children":"result<QueryResult>"}],"："]}],"\n"]}],"\n",["$","li",null,{"className":"x:my-[.5em]","children":["\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":["成功时包含查询结果的 ",["$","code",null,{"className":"nextra-code","dir":"ltr","children":"QueryResult"}]]}],"\n"]}],"\n",["$","li",null,{"className":"x:my-[.5em]","children":["\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":"失败时包含错误状态和消息"}],"\n"]}],"\n",["$","li",null,{"className":"x:my-[.5em]","children":["\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":[["$","strong",null,{"children":"自版本："}]," v0.1.0"]}],"\n"]}],"\n"]}],"\n",["$","h4",null,{"id":"query-1","className":"x:tracking-tight x:text-slate-900 x:dark:text-slate-100 x:font-semibold x:target:animate-[fade-in_1.5s] x:mt-8 x:text-xl","children":[["$","code",null,{"className":"nextra-code","dir":"ltr","children":"Query(...)"}],["$","$L1b",null,{"id":"query-1"}]]}],"\n",["$","div",null,{"data-pagefind-ignore":"all","className":"nextra-code x:relative x:not-first:mt-[1.25em]","children":["$undefined",["$","pre",null,{"className":"x:group x:focus-visible:nextra-focus x:overflow-x-auto x:subpixel-antialiased x:text-[.9em] x:bg-white x:dark:bg-black x:py-4 x:ring-1 x:ring-inset x:ring-gray-300 x:dark:ring-neutral-700 x:contrast-more:ring-gray-900 x:contrast-more:dark:ring-gray-50 x:contrast-more:contrast-150 x:rounded-md not-prose","tabIndex":"0","children":[["$","div",null,{"className":"x:group-hover:opacity-100 x:group-focus:opacity-100 x:opacity-0 x:transition x:focus-within:opacity-100 x:flex x:gap-1 x:absolute x:right-4 x:top-2","children":[["$","$L1a",null,{"children":["$","svg",null,{"viewBox":"0 0 24 24","fill":"currentColor","height":"1em","children":["$","path",null,{"d":"M4 19h6v-2H4v2zM20 5H4v2h16V5zm-3 6H4v2h13.25c1.1 0 2 .9 2 2s-.9 2-2 2H15v-2l-3 3l3 3v-2h2c2.21 0 4-1.79 4-4s-1.79-4-4-4z"}]}]}],false]}],["$","code",null,{"className":"nextra-code","dir":"ltr","children":[["$","span",null,{"children":[["$","span",null,{"style":{"--shiki-light":"#6F42C1","--shiki-dark":"#B392F0"},"children":"Query"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"("}]]}],"\n",["$","span",null,{"children":[["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"    const"}],["$","span",null,{"style":{"--shiki-light":"#6F42C1","--shiki-dark":"#B392F0"},"children":" std"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"::string "}],["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"&"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"query_string,"}]]}],"\n",["$","span",null,{"children":[["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"    const"}],["$","span",null,{"style":{"--shiki-light":"#6F42C1","--shiki-dark":"#B392F0"},"children":" std"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"::string "}],["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"&"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"access_mode,"}]]}],"\n",["$","span",null,{"children":[["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"    const"}],["$","span",null,{"style":{"--shiki-light":"#6F42C1","--shiki-dark":"#B392F0"},"children":" rapidjson"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"::Value "}],["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"&"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"parameters_json"}]]}],"\n",["$","span",null,{"children":["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":")"}]}]]}]]}]]}],"\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":"使用 JSON 参数执行 Cypher 查询。"}],"\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":"参数值以 JSON 对象的形式提供。"}],"\n",["$","ul",null,{"className":"x:[:is(ol,ul)_&]:my-[.75em] x:not-first:mt-[1.25em] x:list-disc x:ms-[1.5em]","children":["\n",["$","li",null,{"className":"x:my-[.5em]","children":[["$","strong",null,{"children":"参数："}],"\n",["$","ul",null,{"className":"x:[:is(ol,ul)_&]:my-[.75em] x:not-first:mt-[1.25em] x:list-disc x:ms-[1.5em]","children":["\n",["$","li",null,{"className":"x:my-[.5em]","children":["$","code",null,{"className":"nextra-code","dir":"ltr","children":"query_string"}]}],"\n",["$","li",null,{"className":"x:my-[.5em]","children":["$","code",null,{"className":"nextra-code","dir":"ltr","children":"access_mode"}]}],"\n",["$","li",null,{"className":"x:my-[.5em]","children":["$","code",null,{"className":"nextra-code","dir":"ltr","children":"parameters_json"}]}],"\n"]}],"\n"]}],"\n"]}],"\n",["$","h4",null,{"id":"getschema-const","className":"x:tracking-tight x:text-slate-900 x:dark:text-slate-100 x:font-semibold x:target:animate-[fade-in_1.5s] x:mt-8 x:text-xl","children":[["$","code",null,{"className":"nextra-code","dir":"ltr","children":"GetSchema() const"}],["$","$L1b",null,{"id":"getschema-const"}]]}],"\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":["以 ",["$","code",null,{"className":"nextra-code","dir":"ltr","children":"YAML"}]," 字符串形式获取数据库模式。"]}],"\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":["返回完整的图模式定义，格式为 ",["$","code",null,{"className":"nextra-code","dir":"ltr","children":"YAML"}],"，包括所有顶点类型、边类型及其属性。"]}],"\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":["$","strong",null,{"children":"使用示例："}]}],"\n",["$","div",null,{"data-pagefind-ignore":"all","className":"nextra-code x:relative x:not-first:mt-[1.25em]","children":["$undefined",["$","pre",null,{"className":"x:group x:focus-visible:nextra-focus x:overflow-x-auto x:subpixel-antialiased x:text-[.9em] x:bg-white x:dark:bg-black x:py-4 x:ring-1 x:ring-inset x:ring-gray-300 x:dark:ring-neutral-700 x:contrast-more:ring-gray-900 x:contrast-more:dark:ring-gray-50 x:contrast-more:contrast-150 x:rounded-md not-prose","tabIndex":"0","children":[["$","div",null,{"className":"x:group-hover:opacity-100 x:group-focus:opacity-100 x:opacity-0 x:transition x:focus-within:opacity-100 x:flex x:gap-1 x:absolute x:right-4 x:top-2","children":[["$","$L1a",null,{"children":["$","svg",null,{"viewBox":"0 0 24 24","fill":"currentColor","height":"1em","children":["$","path",null,{"d":"M4 19h6v-2H4v2zM20 5H4v2h16V5zm-3 6H4v2h13.25c1.1 0 2 .9 2 2s-.9 2-2 2H15v-2l-3 3l3 3v-2h2c2.21 0 4-1.79 4-4s-1.79-4-4-4z"}]}]}],false]}],["$","code",null,{"className":"nextra-code","dir":"ltr","children":[["$","span",null,{"children":[["$","span",null,{"style":{"--shiki-light":"#6F42C1","--shiki-dark":"#B392F0"},"children":"std"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"::string schema_yaml "}],["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"="}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":" conn->"}],["$","span",null,{"style":{"--shiki-light":"#6F42C1","--shiki-dark":"#B392F0"},"children":"GetSchema"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"();"}]]}],"\n",["$","span",null,{"children":[["$","span",null,{"style":{"--shiki-light":"#6F42C1","--shiki-dark":"#B392F0"},"children":"std"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"::cout "}],["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"<<"}],["$","span",null,{"style":{"--shiki-light":"#032F62","--shiki-dark":"#9ECBFF"},"children":" \"Schema:"}],["$","span",null,{"style":{"--shiki-light":"#005CC5","--shiki-dark":"#79B8FF"},"children":"\\n"}],["$","span",null,{"style":{"--shiki-light":"#032F62","--shiki-dark":"#9ECBFF"},"children":"\""}],["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":" <<"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":" schema_yaml "}],["$","span",null,{"style":{"--shiki-light":"#D73A49","--shiki-dark":"#F97583"},"children":"<<"}],["$","span",null,{"style":{"--shiki-light":"#6F42C1","--shiki-dark":"#B392F0"},"children":" std"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"::endl;"}]]}]]}]]}]]}],"\n",["$","ul",null,{"className":"x:[:is(ol,ul)_&]:my-[.75em] x:not-first:mt-[1.25em] x:list-disc x:ms-[1.5em]","children":["\n",["$","li",null,{"className":"x:my-[.5em]","children":["\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":["$","strong",null,{"children":"抛出异常："}]}],"\n",["$","ul",null,{"className":"x:[:is(ol,ul)_&]:my-[.75em] x:not-first:mt-[1.25em] x:list-disc x:ms-[1.5em]","children":["\n",["$","li",null,{"className":"x:my-[.5em]","children":[["$","code",null,{"className":"nextra-code","dir":"ltr","children":"std::runtime_error"}],"：如果连接已关闭"]}],"\n"]}],"\n"]}],"\n",["$","li",null,{"className":"x:my-[.5em]","children":["\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":[["$","strong",null,{"children":"返回值："}]," ",["$","code",null,{"className":"nextra-code","dir":"ltr","children":"std::string"}]," YAML 格式的模式定义"]}],"\n"]}],"\n",["$","li",null,{"className":"x:my-[.5em]","children":["\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":[["$","strong",null,{"children":"自版本："}]," v0.1.0"]}],"\n"]}],"\n"]}],"\n",["$","h4",null,{"id":"close","className":"x:tracking-tight x:text-slate-900 x:dark:text-slate-100 x:font-semibold x:target:animate-[fade-in_1.5s] x:mt-8 x:text-xl","children":[["$","code",null,{"className":"nextra-code","dir":"ltr","children":"Close()"}],["$","$L1b",null,{"id":"close"}]]}],"\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":"关闭连接并释放资源。"}],"\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":["标记连接为已关闭状态并释放任何持有的资源。关闭后，任何 ",["$","code",null,{"className":"nextra-code","dir":"ltr","children":"Query()"}]," 调用都将失败。"]}],"\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":["$","strong",null,{"children":"使用示例："}]}],"\n",["$","div",null,{"data-pagefind-ignore":"all","className":"nextra-code x:relative x:not-first:mt-[1.25em]","children":["$undefined",["$","pre",null,{"className":"x:group x:focus-visible:nextra-focus x:overflow-x-auto x:subpixel-antialiased x:text-[.9em] x:bg-white x:dark:bg-black x:py-4 x:ring-1 x:ring-inset x:ring-gray-300 x:dark:ring-neutral-700 x:contrast-more:ring-gray-900 x:contrast-more:dark:ring-gray-50 x:contrast-more:contrast-150 x:rounded-md not-prose","tabIndex":"0","children":[["$","div",null,{"className":"x:group-hover:opacity-100 x:group-focus:opacity-100 x:opacity-0 x:transition x:focus-within:opacity-100 x:flex x:gap-1 x:absolute x:right-4 x:top-2","children":[["$","$L1a",null,{"children":["$","svg",null,{"viewBox":"0 0 24 24","fill":"currentColor","height":"1em","children":["$","path",null,{"d":"M4 19h6v-2H4v2zM20 5H4v2h16V5zm-3 6H4v2h13.25c1.1 0 2 .9 2 2s-.9 2-2 2H15v-2l-3 3l3 3v-2h2c2.21 0 4-1.79 4-4s-1.79-4-4-4z"}]}]}],false]}],["$","code",null,{"className":"nextra-code","dir":"ltr","children":[["$","span",null,{"children":[["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"conn->"}],["$","span",null,{"style":{"--shiki-light":"#6F42C1","--shiki-dark":"#B392F0"},"children":"Close"}],["$","span",null,{"style":{"--shiki-light":"#24292E","--shiki-dark":"#E1E4E8"},"children":"();"}]]}],"\n",["$","span",null,{"children":["$","span",null,{"style":{"--shiki-light":"#6A737D","--shiki-dark":"#6A737D"},"children":"// conn->Query(...) 现在将返回错误"}]}]]}]]}]]}],"\n",["$","ul",null,{"className":"x:[:is(ol,ul)_&]:my-[.75em] x:not-first:mt-[1.25em] x:list-disc x:ms-[1.5em]","children":["\n",["$","li",null,{"className":"x:my-[.5em]","children":["\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":["$","strong",null,{"children":"注意事项："}]}],"\n",["$","ul",null,{"className":"x:[:is(ol,ul)_&]:my-[.75em] x:not-first:mt-[1.25em] x:list-disc x:ms-[1.5em]","children":["\n",["$","li",null,{"className":"x:my-[.5em]","children":"此方法是幂等的 - 多次调用是安全的。"}],"\n",["$","li",null,{"className":"x:my-[.5em]","children":"连接也会在析构函数中自动关闭。"}],"\n"]}],"\n"]}],"\n",["$","li",null,{"className":"x:my-[.5em]","children":["\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":[["$","strong",null,{"children":"自版本："}]," v0.1.0"]}],"\n"]}],"\n"]}],"\n",["$","h4",null,{"id":"isclosed-const","className":"x:tracking-tight x:text-slate-900 x:dark:text-slate-100 x:font-semibold x:target:animate-[fade-in_1.5s] x:mt-8 x:text-xl","children":[["$","code",null,{"className":"nextra-code","dir":"ltr","children":"IsClosed() const"}],["$","$L1b",null,{"id":"isclosed-const"}]]}],"\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":"检查连接是否已关闭。"}],"\n",["$","ul",null,{"className":"x:[:is(ol,ul)_&]:my-[.75em] x:not-first:mt-[1.25em] x:list-disc x:ms-[1.5em]","children":["\n",["$","li",null,{"className":"x:my-[.5em]","children":["\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":[["$","strong",null,{"children":"返回值："}]," 如果连接已关闭则返回 ",["$","code",null,{"className":"nextra-code","dir":"ltr","children":"true"}],"，如果仍然活跃则返回 ",["$","code",null,{"className":"nextra-code","dir":"ltr","children":"false"}]]}],"\n"]}],"\n",["$","li",null,{"className":"x:my-[.5em]","children":["\n",["$","p",null,{"className":"x:not-first:mt-[1.25em] x:leading-7","children":[["$","strong",null,{"children":"自版本："}]," v0.1.0"]}],"\n"]}],"\n"]}]]}]]}]]}]}]
8:[["$","meta","0",{"name":"viewport","content":"width=device-width, initial-scale=1"}],["$","meta","1",{"charSet":"utf-8"}],["$","title","2",{"children":"连接 | "}],["$","meta","3",{"name":"description","content":"x"}],["$","meta","4",{"name":"msapplication-TileColor","content":"#fff"}]]
1:null
